Tekla.Structures.Analysis.AnalysisArea.#ctor
Initializes a new instance of the Tekla.Structures.Analysis.AnalysisArea class.

Tekla.Structures.Analysis.AnalysisArea.Label
Gets or sets the label of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.AnalysisType
Gets or sets the analysis type of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.Material
Gets or sets the material of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.Profile
Gets or sets the profile of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.Thickness
Gets or sets the thickness of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.Area
Gets or sets the area polygon of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.AreaHoles
Gets or sets the area holes of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.InnerPositions
Gets or sets the inner positions of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.RigidDiaphragm
Gets or sets the rigid diaphragm of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.AnalysisDesignCode
Gets or sets the design code of the analysis area.

Tekla.Structures.Analysis.AnalysisArea.Select
Selects an analysis area.
The AnalysisModelName and ID have to be set.

Tekla.Structures.Analysis.AnalysisArea.Modify
Modifies an analysis area.
Method is not implemented yet.

Tekla.Structures.Analysis.AnalysisArea.Delete
Deletes an analysis area.
Method is not implemented yet.